In [1]:
import pandas as pd

In [2]:
titanic=pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv"
                   ,sep="\t")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# To know the Data types of the columns
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## describe__> provide info only on numeric column

In [6]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

##### What is 25% - suppose a data 5,4,1,9,12,2,8,7,3,6,11,10
##### first sort the data in ascending i.e 1,2,3,4,5,6,7,8,9,10,11,12 
##### now 25% is 3 ,50% is 6, 75% is 9
#### 3 is the 25th record not 25 record

## For Categorial Variable

In [9]:
### in order to describe categorial variable 1 way is to select them all
titanic[["Name","Sex","Ticket","Cabin","Embarked"]].describe()

                              Name   Sex        Ticket Cabin Embarked
count                          156   156           156    31      155
unique                         156     2           145    28        3
top     Andreasson, Mr. Paul Edvin  male  S.O.C. 14879  C123        S
freq                             1   100             2     2      110

#### But this approach is not good what if we have 1000 variable
### 2nd Way

In [22]:
titanic.dtypes[titanic.dtypes=="object"]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

##### if we check its type its Series

In [23]:
type(titanic.dtypes[titanic.dtypes=="object"])

pandas.core.series.Series

##### But we are interestred in fetching the index

In [24]:
titanic.dtypes[titanic.dtypes=="object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [29]:
a=titanic.dtypes[titanic.dtypes=="object"].index
titanic[a].describe()

                              Name   Sex        Ticket Cabin Embarked
count                          156   156           156    31      155
unique                         156     2           145    28        3
top     Andreasson, Mr. Paul Edvin  male  S.O.C. 14879  C123        S
freq                             1   100             2     2      110

###### We pass titanic[a] only in single[] we use double in case of passing multiple coulms it means passing col name in list titanic[["a","b","c"]]

## like this we can extract anty data type column

In [30]:
b=titanic.dtypes[titanic.dtypes=="int64"].index
titanic[b].describe()

       PassengerId    Survived      Pclass       SibSp       Parch
count   156.000000  156.000000  156.000000  156.000000  156.000000
mean     78.500000    0.346154    2.423077    0.615385    0.397436
std      45.177428    0.477275    0.795459    1.056235    0.870146
min       1.000000    0.000000    1.000000    0.000000    0.000000
25%      39.750000    0.000000    2.000000    0.000000    0.000000
50%      78.500000    0.000000    3.000000    0.000000    0.000000
75%     117.250000    1.000000    3.000000    1.000000    0.000000
max     156.000000    1.000000    3.000000    5.000000    5.000000

## Dataframe as a list

In [31]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [32]:
titanic["Name"][0]

'Braund, Mr. Owen Harris'

In [34]:
titanic["Name"][5:11]

5                                      Moran, Mr. James
6                               McCarthy, Mr. Timothy J
7                        Palsson, Master. Gosta Leonard
8     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                   Nasser, Mrs. Nicholas (Adele Achem)
10                      Sandstrom, Miss. Marguerite Rut
Name: Name, dtype: object

In [35]:
# Extracting even numners  starrting from 2
titanic["Name"][2:21:2]

2                                Heikkinen, Miss. Laina
4                              Allen, Mr. William Henry
6                               McCarthy, Mr. Timothy J
8     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
10                      Sandstrom, Miss. Marguerite Rut
12                       Saundercock, Mr. William Henry
14                 Vestrom, Miss. Hulda Amanda Adolfina
16                                 Rice, Master. Eugene
18    Vander Planke, Mrs. Julius (Emelia Maria Vande...
20                                 Fynney, Mr. Joseph J
Name: Name, dtype: object

##### Doing same operation in data Frame

In [37]:
titanic[["Age"]][2:21:2]

     Age
2   26.0
4   35.0
6   54.0
8   27.0
10   4.0
12  20.0
14  14.0
16   2.0
18  31.0
20  35.0

In [38]:
titanic[["Name","Age"]][2:21:2]

                                                 Name   Age
2                              Heikkinen, Miss. Laina  26.0
4                            Allen, Mr. William Henry  35.0
6                             McCarthy, Mr. Timothy J  54.0
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
10                    Sandstrom, Miss. Marguerite Rut   4.0
12                     Saundercock, Mr. William Henry  20.0
14               Vestrom, Miss. Hulda Amanda Adolfina  14.0
16                               Rice, Master. Eugene   2.0
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...  31.0
20                               Fynney, Mr. Joseph J  35.0

# Sorting in Pandas

In [36]:
sorted(titanic["Fare"])[0:10] 
# It gives the output in the form of list

[6.75, 6.975, 7.05, 7.1417, 7.225, 7.225, 7.2292, 7.2292, 7.2292, 7.25]

In [37]:
type(sorted(titanic["Fare"])[0:10])

list

#### sort_values give output in form of Series or DataFrame

In [38]:
srt=titanic["Fare"].sort_values()
type(srt)

pandas.core.series.Series

In [40]:
srt[0:3]

143    6.750
129    6.975
131    7.050
Name: Fare, dtype: float64

In [44]:
df_srt=titanic.sort_values("Fare")
df_srt[0:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
143,144,0,3,"Burke, Mr. Jeremiah",male,19.0,0,0,365222,6.750,NaN,Q
129,130,0,3,"Ekstrom, Mr. Johan",male,45.0,0,0,347061,6.975,NaN,S
131,132,0,3,"Coelho, Mr. Domingos Fernandeo",male,20.0,0,0,SOTON/O.Q. 3101307,7.050,NaN,S

In [45]:
type(df_srt)

pandas.core.frame.DataFrame

### Sorting on object data type

In [27]:
sorted(titanic["Name"])[0:5]

['Ahlin, Mrs. Johan (Johanna Persdotter Larsson)',
 'Allen, Mr. William Henry',
 'Andersson, Miss. Ellis Anna Maria',
 'Andersson, Miss. Erna Alexandra',
 'Andersson, Mr. Anders Johan']

In [31]:
titanic.sort_values("Name")["Name"]

40     Ahlin, Mrs. Johan (Johanna Persdotter Larsson)
4                            Allen, Mr. William Henry
119                 Andersson, Miss. Ellis Anna Maria
68                    Andersson, Miss. Erna Alexandra
13                        Andersson, Mr. Anders Johan
                            ...
155                       Williams, Mr. Charles Duane
17                       Williams, Mr. Charles Eugene
55                                  Woolner, Mr. Hugh
111                              Zabour, Miss. Hileni
153                   van Billiard, Mr. Austin Blyler
Name: Name, Length: 156, dtype: object

In [32]:
obj_srt=titanic.sort_values("Name")
obj_srt["Name"]

40     Ahlin, Mrs. Johan (Johanna Persdotter Larsson)
4                            Allen, Mr. William Henry
119                 Andersson, Miss. Ellis Anna Maria
68                    Andersson, Miss. Erna Alexandra
13                        Andersson, Mr. Anders Johan
                            ...
155                       Williams, Mr. Charles Duane
17                       Williams, Mr. Charles Eugene
55                                  Woolner, Mr. Hugh
111                              Zabour, Miss. Hileni
153                   van Billiard, Mr. Austin Blyler
Name: Name, Length: 156, dtype: object

#### Q saving describe data into Data Frame

In [13]:
df=titanic.describe()
df

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

##### select one column and filter all data on even index

In [18]:
age_dt=titanic["Age"][0::2]
type(age_dt)

pandas.core.series.Series

#### Convert age_dt in dataFrame

In [21]:
age_frm=pd.DataFrame(age_dt)
age_frm.head()

    Age
0  22.0
2  26.0
4  35.0
6  54.0
8  27.0

In [50]:
sort_val=age_frm.sort_values(by="Age")
sort_val[0:3] # nte it give first 3 values not index 0 to 3 sfter sorting

     Age
78  0.83
16  2.00
10  4.00

In [60]:
sorted(age_frm["Age"])[0:5] # sorted is not giving valid results

[2.0, 4.0, 5.0, 7.0, 8.0]

### Extract first name from Name and create and a new column

##### Creating copy to titanic as titanic_raw

In [98]:
titanic_raw=titanic
titanic_raw.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [74]:
s="Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkinson)"
spt=s.split(sep=",")
spt[0]

'Faunthorpe'

In [76]:
l=str()
lst=[]
for i in titanic["Name"]:
    l=i.split(sep=",")
    lst.append(l[0])

In [99]:
titanic_raw["Frst_nme"]=lst
titanic_raw.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Frst_nme
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen

##### Q-2 Extract only first char from cabin and create a new column Cabin-1

In [105]:
# Changing Object type to Str 
str_cab=titanic["Cabin"].astype(str)
cab=[i[0] for i in str_cab]
titanic_raw["cabin_1"]=cab
titanic_raw.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Frst_nme,cabin_1
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,n
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,n
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,n

In [106]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Where Condition

In [109]:
titanic["Age"].isnull()==True

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154     True
155    False
Name: Age, Length: 156, dtype: bool

In [122]:
import numpy as np
np.where(titanic["Age"].isnull()==True)

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

##### It will retur the Index where Age in null

In [152]:
miss=np.where(titanic["Age"].isnull()==True)
miss

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

## Extract Max Fare

In [148]:
mxfre=np.where(titanic["Fare"]==titanic["Fare"].max())
mxfre

(array([27, 88], dtype=int64),)

In [151]:
titanic["Fare"][27]

263.0

# ILOC(Integer Location)-- Used to extract rows/row selection

#### Extracting setail of passanger whose age in null

In [154]:
titanic.iloc[miss].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q

In [157]:
# If we want to see only name and age 
titanic[["Name","Age"]].iloc[miss].head()

                             Name  Age
5                Moran, Mr. James  NaN
17   Williams, Mr. Charles Eugene  NaN
19        Masselmani, Mrs. Fatima  NaN
26        Emir, Mr. Farred Chehab  NaN
28  O'Dwyer, Miss. Ellen "Nellie"  NaN

In [158]:
# similarly for max fare customers
titanic.iloc[mxfre].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0,C23 C25 C27,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0,C23 C25 C27,S

## Extract Name and cabin detail of a person having Minmium Age

In [163]:
min_age=np.where(titanic["Age"]==min(titanic["Age"]))
min_age

(array([78], dtype=int64),)

In [165]:
titanic[["Name","Cabin"]].iloc[min_age]

                             Name Cabin
78  Caldwell, Master. Alden Gates   NaN

### Concatenate two columns "sibsp" and "parch" form new col "Family" and give detail of max family

In [166]:
titanic["Family"]=titanic["SibSp"]+titanic["Parch"]
mx=np.where(titanic["Family"]==titanic["Family"].max())
titanic.iloc[mx]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,NaN,S,7
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9,NaN,S,7

# Converting List,array, dictionary into series or DataFrame

In [171]:
lables=["a","b","c"]
my_data=[10,20,30]
arr=np.array(my_data)
d={"a":10,"b":20,"c":30}

print("lables",lables)
print("Array",arr)
print("Dictinary",d)

lables ['a', 'b', 'c']
Array [10 20 30]
Dictinary {'a': 10, 'b': 20, 'c': 30}

In [169]:
#### Conversion to Series
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [172]:
##### To get label/index of our choice we can do
pd.Series(my_data,index=lables)

a    10
b    20
c    30
dtype: int64

In [176]:
dta=pd.Series(my_data,index=["first","Second","third"])
dta

first     10
Second    20
third     30
dtype: int64

###### Though we have change the name of Index but still system remember index[0],[1] and so on

In [179]:
dta["Second"]

20

In [180]:
dta[1]

20

## for Array

In [183]:
pd.Series(arr,index=lables)

a    10
b    20
c    30
dtype: int32

# For Dictionary

In [34]:
d={"a":10,"b":20,"c":30}
d.items()

dict_items([('a', 10), ('b', 20), ('c', 30)])

In [36]:
pd.DataFrame(d)

ValueError: If using all scalar values, you must pass an index

In [187]:
pd.DataFrame(d,index=lables)

    a   b   c
a  10  20  30
b  10  20  30
c  10  20  30

In [188]:
pd.DataFrame(d,index=["first","Second","third"])

         a   b   c
first   10  20  30
Second  10  20  30
third   10  20  30

###### Notice since dict has only 3 itesm for (a,b,c) but still its showing 3 rows coz e pass 3 index

In [189]:
pd.DataFrame(d,index=["first","Second","third",7,8,9,"ko"])

         a   b   c
first   10  20  30
Second  10  20  30
third   10  20  30
7       10  20  30
8       10  20  30
9       10  20  30
ko      10  20  30

In [191]:
##### also we can do
pd.Series([type,max,min])

0             <class 'type'>
1    <built-in function max>
2    <built-in function min>
dtype: object

# Concatination in Series

In [193]:
s1=pd.Series([1,2,3,4],index=["CA","OR","CO","CA"])
s2=pd.Series([1,2,5,4],index=["CA","NV","AZ","OR"])
s3=s1+s2
s3

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

#### Here notive NaN+value=Nan
#### now since "CA" and "OR" is common index in both series so addition happen otherwise its Nan

In [195]:
s4=s1*s2
s4

AZ    NaN
CA    1.0
CA    4.0
CO    NaN
NV    NaN
OR    8.0
dtype: float64

# Checking if  directory is empty or not

In [203]:
import os
  
# path of the directory
directoryPath = "C:\\Users\\Honey\\Downloads\\Documents\\Python_practise\\Pandas"
if len(os.listdir(directoryPath))==0:
    print("Empty directory")
else:
    print("Not Empty")

Not Empty

In [204]:
len(os.listdir(directoryPath))

21

## to check file exist or not

In [211]:
os.path.isfile('exmple.json')

True

## To check Directory exist or not

In [214]:
os.path.isfile('exmple.json')

True

In [212]:
os.path.isdir("Parent")

True

# Some Random Example

In [4]:
rw=titanic
rw.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

#### Q-Select Age>25

In [11]:
rw[rw["Age"]>25].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [8]:
import numpy as np
ag=np.where(rw["Age"]>25)

In [108]:
rw.iloc[ag].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [109]:
rw.iloc[ag]["Name"].head(3)

1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
Name: Name, dtype: object

## Q selct how much male and female survived

In [72]:
suv=rw[rw["Survived"]==1]

In [113]:
flg=[]
for i in suv["Sex"]:
    if i=="female" :
        flag=0
        flg.append(flag)
    else:
        flag=1
        flg.append(flag)
l0=[]
l1=[]
for i in flg:
    if i==1:
        l1.append(i)
    elif i==0:
        l0.append(i)
        
print("Male Survived :- ",len(l1))
print("Female Survived :- ",len(l0))

Male Survived :-  14
Female Survived :-  40

In [84]:
fsuv=np.where((rw["Survived"]==1) & (rw["Sex"]=="male"))

In [118]:
# Count number of Male

In [117]:
rw[rw["Sex"]=="male"]["Sex"].count()

100

In [85]:
rw.iloc[fsuv]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.00,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.00,0,0,113788,35.5000,A6,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
65,66,1,3,"Moubarek, Master. Gerios",male,NaN,1,1,2661,15.2458,NaN,C
74,75,1,3,"Bing, Mr. Lee",male,32.00,0,0,1601,56.4958,NaN,S
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
81,82,1,3,"Sheerlinck, Mr. Jan Baptist",male,29.00,0,0,345779,9.5000,NaN,S
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.00,0,1,PC 17759,63.3583,D10 D12,C
107,108,1,3,"Moss, Mr. Albert Johan",male,NaN,0,0,312991,7.7750,NaN,S
125,126,1,3,"Nicola-Yarred, Master. Elias",male,12.00,1,0,2651,11.2417,NaN,C
127,128,1,3,"Madsen, Mr. Fridtjof Arne",male,24.00,0,0,C 17369,7.1417,NaN,S
146,147,1,3,"Andersson, Mr. August Edvard (""Wennerstrom"")",male,27.00,0,0,350043,7.7958,NaN,S

# Dropping Columns

In [90]:
rw["Flag"]="Kimg"
rw.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Flag
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Kimg
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Kimg

In [94]:
rw.drop(["Flag"],axis=1).head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [95]:
#Notice using drop command ddelete the data for trhat instance only whe have to use inplace for prmanent delete the rcrd
rw.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Flag
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Kimg
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Kimg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Kimg
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Kimg
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Kimg

In [97]:
rw.drop(["Flag"],axis=1,inplace=True)

In [98]:
rw.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C